(c) 2016 - present. Enplus Advisors, Inc.

In [2]:
import numpy as np
import pandas as pd

In [3]:
df = pd.DataFrame({
    'ticker': ['AAPL', 'AAPL', 'MSFT', 'IBM', 'YHOO'],
    'date': ['2015-12-30', '2015-12-31', '2015-12-30', '2015-12-30', '2015-12-30'],
    'open': [426.23, 427.81, 42.3, 101.65, 35.53]
})

**Exercise:**

* Select the `open` column as a `Series` using attribute lookup
* Select the `open` column as a `Series` using `dict`-style lookup
* Select the `date` column as a `DataFrame`

In [4]:
df.open

0    426.23
1    427.81
2     42.30
3    101.65
4     35.53
Name: open, dtype: float64

In [5]:
df['open']

0    426.23
1    427.81
2     42.30
3    101.65
4     35.53
Name: open, dtype: float64

In [6]:
df[['date']]

         date
0  2015-12-30
1  2015-12-31
2  2015-12-30
3  2015-12-30
4  2015-12-30

**Exercise:**

* Select all rows with the `AAPL` ticker and the `date` and `open`
  columns.
* Assign to the variable `df1` a new `DataFrame` with `ticker` as
  the index.
* Assign to the variable `df2` a new `DataFrame` with `date` as
  the index. Create this `DataFrame` from `df1` with a single
  statement.
* Sort `df2` by the index values.

In [31]:
df[df['ticker']=='AAPL'][['date','open']]

         date    open
0  2015-12-30  426.23
1  2015-12-31  427.81

In [32]:
df1 = df.set_index('ticker')
df2 = df1.reset_index().set_index('date')

In [35]:
df
df1
df2

           ticker    open
date
2015-12-30   AAPL  426.23
2015-12-31   AAPL  427.81
2015-12-30   MSFT   42.30
2015-12-30    IBM  101.65
2015-12-30   YHOO   35.53

In [36]:
df2.sort_index()

           ticker    open
date
2015-12-30   AAPL  426.23
2015-12-30   MSFT   42.30
2015-12-30    IBM  101.65
2015-12-30   YHOO   35.53
2015-12-31   AAPL  427.81

2**Exercise:**

* Create a copy of `df` called `df3`. Add a new column of `NaNs` 
  to `df3` called `close`. Assign `close` the same value as `open`
  for all `open` values greater than 100.
* Sort `df3` by its `close` values.